АлогистикТест2/src/DataProcessors/алк_РабочееМестоПоСписаниюПакетов/алк_РабочееМестоПоСписаниюПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РабочееМестоПоСписаниюПакетов</name>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ТипСмен/алк_ТипСмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипСмен</name>
  <enumValues>
    <name>Двухсменка</name>
  </enumValues>
  <enumValues>
    <name>Трехсменка</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыСкладскихОпераций/алк_ВидыСкладскихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыСкладскихОпераций</name>
  <enumValues>
    <name>Пересортица</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеПакетируемого</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеНеПакетируемого</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаНеПакетируемого</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_СкладскиеОперации/алк_СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СкладскиеОперации</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.алк_ОснованиеСкладскойОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_Производство</types>
      <types>DocumentRef.алк_Инвентаризация</types>
      <types>DocumentRef.алк_ТранспортировкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оприходование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Несортированный</name>
      <description>Несортированный</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
  </predefined>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_РабочееМестоПоСписаниюПакетов/Forms/Форма/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Справочники.Номенклатура.Шпон;
	
	ДатаСмены = ТекущаяДата();
	
	Организация = Справочники.Организации.ОсновнаяОрганизация; 
	
	ЗаполнитьПараметрыСписокДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ДатаСмены) Тогда 
		ДатаСмены = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьПараметрыСписокДокументов();
		
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент) 
		
	ИзменитьСмену(); 
	
	ЗаполнитьПараметрыСписокДокументов();
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокСерийныхНомеровСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//пустая ТЧ или заполненная?
	ОтборПоСН = Ложь;
	МассивСН = Новый Массив;
	Если СписокСерийныхНомеров.Количество() > 0 И ЗначениеЗаполнено(СписокСерийныхНомеров[0].СерийныйНомер) Тогда
		ОтборПоСН = Истина;
		Для Каждого сн ИЗ СписокСерийныхНомеров Цикл
			Если ЗначениеЗаполнено(сн.СерийныйНомер) Тогда 
			МассивСН.Добавить(сн.СерийныйНомер);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//\\
	
	ВызватьФормуВыбора("",Ложь,Склад,ОтборПоСН,МассивСН,ПолучитьКатегориюНоменклатуры(Номенклатура));  
	
	ПроверитьНаОтрицательныеПакеты();

КонецПроцедуры 

&НаКлиенте
Процедура СписокСерийныхНомеровСерийныйНомерПриИзменении(Элемент)
	
	//если не заполнили серийный номер
	ТекДанные = Элементы.СписокСерийныхНомеров.ТекущиеДанные; 
	Если Не ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда
		Возврат;	
	КонецЕсли;
	
	//проверка, что серийного номера нет в тч
	Если Не СерийныйНомерВТЧ(ТекДанные.СерийныйНомер)Тогда 

		ЗаполнитьЗначенияСвойств(ТекДанные, ЗагрузитьДанныеПоСерийномуНомеру(ТекДанные.СерийныйНомер)[0]); 
	Иначе 
		Возврат;
	КонецЕсли;
	//\\
	
	//заполнение номера серии по номеру пакета
	ТекДанные.НомерПакета = ПолучитьНомерПакета(ТекДанные.СерийныйНомер);  
	//\\ 
	
	ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокСерийныхНомеровНомерПакетаПриИзменении(Элемент)
	
	//если не заполнили номер пакета
	ТекДанные = Элементы.СписокСерийныхНомеров.ТекущиеДанные; 
	Если Не ЗначениеЗаполнено(ТекДанные.НомерПакета) Тогда
		Возврат;	
	КонецЕсли;
	//\\
	
	ДанныеПоПакету = ПолучитьДанныеПоПакету(ТекДанные.НомерПакета,Номенклатура,Склад);
	
	//нет на остатках пакета с данным номером
	Если ДанныеПоПакету.Количество() = 0 Тогда
		Сообщить("Данного пакета нет на остатках! Проверьте правильность заполнения.");
		Возврат;
	КонецЕсли;
	//\\ 
	
	//пустая ТЧ или заполненная?
	ОтборПоСН = Ложь;
	МассивСН = Новый Массив;
	Если СписокСерийныхНомеров.Количество() > 0 И ЗначениеЗаполнено(СписокСерийныхНомеров[0].СерийныйНомер) Тогда
		ОтборПоСН = Истина;
		Для Каждого сн ИЗ СписокСерийныхНомеров Цикл
			Если ЗначениеЗаполнено(сн.СерийныйНомер) Тогда 
			МассивСН.Добавить(сн.СерийныйНомер);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//\\
  	
	//если есть пакет(ы) на остатках
	Если ДанныеПоПакету.Количество() <> 1 Тогда
		ВызватьФормуВыбора(Формат(ТекДанные.НомерПакета,"ЧГ=0"),Истина,Склад,ОтборПоСН,МассивСН,ПолучитьКатегориюНоменклатуры(Номенклатура))
	Иначе 
		Если СписокСерийныхНомеров.НайтиСтроки(Новый Структура("СерийныйНомер",ДанныеПоПакету[0].СерийныйНомер)).Количество() = 0 Тогда 
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеПоПакету[0]);
		Иначе
			Сообщить(СтрШаблон("Данный пакет %1 уже есть в табличной части!", ДанныеПоПакету[0].СерийныйНомер)); 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//\\  
	
	ПроверитьНаОтрицательныеПакеты();

КонецПроцедуры

#КонецОбласти 

#Область Функции 

&НаСервереБезКонтекста
Функция  ПолучитьСмену(Участок, ДатаСмены)

	ТипСмены = РфпСервер.ПолучитьТипСмены(Участок, ДатаСмены);
	
	Сегодня = ТекущаяДата();
	
	//для двухсменки
	НачалоСмены = НачалоДня(Сегодня) + 8*60*60;
	КонецСмены = КонецДня(Сегодня) - 4*60*60;
	//\\
	
	//для трехсменки
	КонецСменыДень = КонецДня(Сегодня) - 8*60*60;
	КонецСменыВечер = КонецДня(Сегодня);
	//\\
	
	Если ТипСмены = Перечисления.алк_ТипСмен.Двухсменка Тогда 
		
		Если Сегодня >= НачалоСмены И Сегодня <= КонецСмены Тогда 
			Возврат Справочники.алк_Смены.День_2;
		Иначе
			Возврат Справочники.алк_Смены.Ночь_2;
		КонецЕсли;
		
	ИначеЕсли ТипСмены = Перечисления.алк_ТипСмен.Трехсменка Тогда
			
		Если Сегодня >= НачалоСмены И Сегодня <= КонецСменыДень Тогда 
			Возврат Справочники.алк_Смены.День_3;
		ИначеЕсли Сегодня > КонецСменыДень И Сегодня <= КонецСменыВечер Тогда 
			Возврат Справочники.алк_Смены.Вечер_3; 
		Иначе 
			Возврат Справочники.алк_Смены.Ночь_3;
		КонецЕсли;

	Иначе
		Возврат Справочники.алк_Смены.ПустаяСсылка();
	КонецЕсли;

КонецФункции 

&НаСервереБезКонтекста
Функция  ПолучитьНомерПакета (СерийныйНомер)
		
	Возврат СтрЗаменить(СокрЛ(СтрЗаменить(Сред(СерийныйНомер,7),"0"," "))," ","0");
 
КонецФункции
//возвращает истину,если серийный номер уже есть в табличной части
&НаСервере
Функция СерийныйНомерВТЧ(СерийныйНомер)
	
	НайденнаяСтрока = СписокСерийныхНомеров.НайтиСтроки(Новый Структура("СерийныйНомер", СерийныйНомер)); 
	
	Если НайденнаяСтрока.Количество() > 1 Тогда 
		Сообщить(СтрШаблон("Серийный номер: %1 уже есть в табличной части!",СерийныйНомер));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

//получение остатков по серийному номеру
&НаСервереБезКонтекста
Функция ЗагрузитьДанныеПоСерийномуНомеру(СерийныйНомер)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОстатки.Номенклатура КАК Номенклатура,
	              |	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	              |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница КАК Склад,
	              |	алк_ОстаткиЗапасовОстатки.Штабель КАК Штабель,
	              |	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	              |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер.Ссылка = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки"; 
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
		
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоПакету(НомерПакета, Номенклатура, Склад)
	
	//получение номера пакета
	Значение = СтрЗаменить(Формат(НомерПакета, "ЧГ="), " ", "");
	НадоНулей = 6 - СтрДлина(Значение); 
	Если НадоНулей = 0 Тогда 
		НомерПакетаСНулями = Значение;
	Иначе 
		НомерПакетаСНулями =  Формат(0,"ЧЦ="+НадоНулей+";ЧН=; ЧВН=; ЧГ=0") + Значение;
	КонецЕсли;
	//\\
	
	//получение серийного номера по номеру пакета
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.Организация,
	|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница КАК Склад,
	|	алк_ОстаткиЗапасовОстатки.Штабель,
	|	алк_ОстаткиЗапасовОстатки.Номенклатура,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И СтруктурнаяЕдиница = &Склад
	|				И СерийныйНомер.Наименование ПОДОБНО ""%"" + &Номер) КАК алк_ОстаткиЗапасовОстатки";  
	
	Запрос.УстановитьПараметр("Номер", НомерПакетаСНулями);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад); 
	//\\
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКатегориюНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.КатегорияНоменклатуры;
	
КонецФункции   

#КонецОбласти

#Область Процедуры
//при изменение дата и участка нужно поменять смену
&НаКлиенте
Процедура ИзменитьСмену()
	
	Если ЗначениеЗаполнено(Участок) И ЗначениеЗаполнено(ДатаСмены) Тогда 		
		Смена = ПолучитьСмену(Участок,ДатаСмены);
		Возврат;
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ВызватьФормуВыбора(НомерПакета, ЗаполнятьНомер, Склад, ОтборПоСН, СписокСН, КатегорияНоменклатуры)
	
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница", Склад); 
	ПараметрыФормы.Вставить("Номер", НомерПакета);     
	ПараметрыФормы.Вставить("ЗаполнятьНомер", ЗаполнятьНомер);   
	ПараметрыФормы.Вставить("ДатаНачалаСмены", Дата(1,1,1)); 
	ПараметрыФормы.Вставить("ДатаОкончанияСмены", Дата(1,1,1)); 
	ПараметрыФормы.Вставить("ЗаСмену", Ложь);
	ПараметрыФормы.Вставить("ОтборПоСН", ОтборПоСН);
	ПараметрыФормы.Вставить("СписокСН", СписокСН);
	ПараметрыФормы.Вставить("КатегорияНоменклатуры", КатегорияНоменклатуры);
		
	ЗавершениеПодбораСерийногоНомера = Новый ОписаниеОповещения("ЗавершениеПодбораСерийногоНомера", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДляСушильногоКомплекса", ПараметрыФормы, ЭтаФорма,,,,ЗавершениеПодбораСерийногоНомера, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаОтрицательныеПакеты()
	
	Для Каждого Стр Из СписокСерийныхНомеров Цикл
		Если Стр.Объем < 0 Тогда
			Сообщить("Пакет " + Стр.СерийныйНомер + " имеет отрицательный остаток. Проверьте его выпуск");		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершениеПодбораСерийногоНомера(Результат, ДополнительныеПараметры) Экспорт  
		
	Если Результат = Неопределено Тогда 
		Возврат
	КонецЕсли;
		
	//добавление стр в ТЧ
	Для Счетчик = 0 ПО Результат.Количество()-1 Цикл
		
		//проверка, что сн нет в тч
		Если Не СерийныйНомерВТЧ(Результат[Счетчик].СерийныйНомер) Тогда 
			СтрокаЗапасы = СписокСерийныхНомеров.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗапасы, Результат[Счетчик]);
			СтрокаЗапасы.НомерПакета = ПолучитьНомерПакета(Результат[Счетчик].СерийныйНомер); 
		КонецЕсли;
		//\\
		
	КонецЦикла;
	//\\
	
	//удаляем строку добавленную пользователем
	ИндексУдалСтр = СписокСерийныхНомеров.Индекс(Элементы.СписокСерийныхНомеров.ТекущиеДанные); 
	СписокСерийныхНомеров.Удалить(ИндексУдалСтр);
	//\\
		
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаполнениеДокументаСкладскиеОперации(ДатаСмены,Смена,Организация,Участок,Склад,Штабель,Основание,НомерПакета,Комментарий) 
	
	//БЛОК ФОРМИРОВАНИЯ ДОКУМЕНТА  
	
	//создание документа
	Док = Документы.алк_СкладскиеОперации.СоздатьДокумент();
	//\\
	
	ЗаполнитьЗначенияСвойств(Док, Новый Структура ("Дата,ДатаСмены,Смена,Организация,Участок,Склад,Штабель,Основание,ВидОперации,СерийныйНомер,Ответственный,Комментарий",ТекущаяДата(),ДатаСмены,Смена,Организация,Участок,Склад,Штабель,Основание,Перечисления.алк_ВидыСкладскихОпераций.Списание,НомерПакета,Пользователи.ТекущийПользователь(),Комментарий));
	
	//проведение документа
	Док.Записать(РежимЗаписиДокумента.Проведение);
	//\\ 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСписокДокументов()
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Смена", Смена);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаСмены", ДатаСмены);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Участок", Участок);
	
	Элементы.СписокДокументов.Обновить();
				
КонецПроцедуры 

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	
	ЗаполнитьПараметрыСписокДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область Команды 

&НаКлиенте
Процедура СформироватьДокумент(Команда)
	
	//проверка заполненности всех параметров
	Если Не ЗначениеЗаполнено(Смена) ИЛИ Не ЗначениеЗаполнено(Организация) ИЛИ Не ЗначениеЗаполнено(Участок) ИЛИ Не ЗначениеЗаполнено(Склад) ИЛИ Не ЗначениеЗаполнено(Основание)  Тогда
		Сообщить("Вы заполнили не все параметры!");
		
		Если Не ЗначениеЗаполнено(Смена) Тогда 
			Сообщить("Заполните смену!");
		КонецЕсли; 
				
		Если Не ЗначениеЗаполнено(Организация) Тогда 
			Сообщить("Заполните организацию!");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Участок) Тогда 
			Сообщить("Заполните участок!");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Склад) Тогда 
			Сообщить("Заполните склад!");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Основание) Тогда 
			Сообщить("Заполните основание!");
		КонецЕсли;
	
		Возврат;
	КонецЕсли;
	//\\
	
	Для Каждого эл ИЗ СписокСерийныхНомеров Цикл 
		ЗаполнениеДокументаСкладскиеОперации(ДатаСмены,Смена,Организация,Участок,Склад,Штабель,Основание,эл.СерийныйНомер,Комментарий);
	КонецЦикла;
	
	СписокСерийныхНомеров.Очистить();
	
	ЗаполнитьПараметрыСписокДокументов();
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда) 
	
	ЗаполнитьПараметрыСписокДокументов();
	
КонецПроцедуры

#КонецОбласти
